# config.py

GUILD_SETTINGS = {
    1074637664503996446: {  # Test
        "role_id": 1243898257801871474,
        "channel_id": 1074637664961179650,
        "voice_name": "VC",
    },
    895995463965216798: {  # K#Q
        "role_id": 1521537000866582599,
        "channel_id": 895995463965216801,
        "voice_name": "ララジオ",
    },
    1384346771173675108: {  # 討伐会
        "role_id": 1384699338806132736,
        "channel_id": 1384346771970326529,
        "voice_name": "一人でナニか",
    },
}

OMIKUJI_NOTIFY = {
    1074637664503996446: {  # Test
        "role_id": 1243898257801871474,
        "channel_id": 1074637664961179650,

        # 通常ユーザー
        "weights": [13, 19, 20, 18, 14, 8, 8, 0],

        # 通知対象ロール
        "role_weights": [0, 0, 0, 0, 0, 0, 0, 1],
    },

    1384346771173675108: {  # 討伐会
        "role_id": 1384699338806132736,
        "channel_id": 1384346771970326529,

        # 通常ユーザー
        "weights": [26, 38, 40, 36, 27, 16, 16, 1],

        # 通知対象ロール
        "role_weights": [10, 10, 10, 10, 10, 10, 10, 1],
    },
}
