# config.py

GUILD_SETTINGS = {
    1074637664503996446: {  # Test
        "role_id": 1243898257801871474,
        "guild_id": 1243898257801871474,
        "channel_id": 1074637664961179650,
        "voice_name": "VC",
    },
    895995463965216798: {  # K#Q
        "role_id": 1521537000866582599,
        "channel_id": 895995463965216801,
        "voice_name": "ララジオ",
    },
    1384346771173675108: {  # 討伐会
        "role_id": 1384699338806132736,
        "guild_id": 1384346771970326529,
        "channel_id": 1384346771970326529,
        "voice_name": "一人語り",
    },
}
